# Напишите функцию,  определяющую является ли число палиндромом.
# Палиндром - число читающееся одинаково слева направо и справа налево.
# Пример палиндрома: 34543
# * попробуйте решить данную задачу, не преобразуя число к строке

def palindrome(number):
    it_palindrome = str(number)
    number = str(number)[::-1]
    if it_palindrome == number:
        return ("Палиндром")
    else:
        return ("Не палиндром")


# Тестируем функцию
print(palindrome(3454))
print(palindrome(3443))
print(palindrome(1234541))
print(palindrome(1234321))
print(palindrome(77777))
print(palindrome(339933))
