# Из остатков кирпичей Сергей сложил пирамиду.
# На вершине пирамиды лежит один кирпич, на втором сверху ряду два кирпича,
# на третьем - три, и т.д., в нижнем ряду пирамиды количество кирпичей равно количеству уровней пирамиды.
# После этого он написал на каждом кирпиче по числу, равному количеству кирпичей на этом уровне,
# т.е. на верхнем уровне 1, на втором уровне 2, и т.д. Определите сумму чисел написанных на кирпичах.
# Формат входных данных: Программе даётся целое число — количество уровней в пирамиде
# Формат выходных данных: Необходимо вывести сумму чисел написанных на кирпичах.

level = int(input("Введите кол-во уровней: "))
i = 1
sum_count_bloks = 0
while i <= level:
    count_bloks = i * i
    print(count_bloks)
    sum_count_bloks = sum_count_bloks + count_bloks
    i += 1
print("Сумма уровней =", sum_count_bloks)

